from string import Template

#### RAG PROMPTS ####

#### System ####

# System prompt
system_prompt = Template('\n'.join([
    "أنت مساعد متعاون يمكنك الإجابة على الأسئلة بناءً على السياق المقدم لك.",
    "سيتم تزويدك بمجموعة من المستندات المتعلقة بسؤال المستخدم.",
    "يجب عليك صياغة إجابة بناءً على المستندات المقدمة فقط.",
    "إذا لم تتمكن من الإجابة على السؤال، يمكنك الاعتذار للمستخدم.",
    "يجب عليك صياغة الإجابة بنفس لغة سؤال المستخدم.",
    "كن مهذباً ومحترماً في تعاملك مع المستخدم.",
    "كن دقيقاً وموجزاً في إجابتك، وتجنب تقديم معلومات غير ضرورية.",
]))


#### Document ####

# Document prompt
documents_prompt = Template(
    "\n".join([
        "## مستند رقم: $doc_num",
        "## المحتوى: $chunk_text",
    ])
)

#### Footer ####

# Footer prompt
footer_prompt = Template(
    "\n".join([
        "بناءً على المستندات المقدمة فقط، أجب على سؤال المستخدم.",
        "## الإجابة:",
    ])
)
